Revit 2027 API
AreaScheme.IsGrossBuildingArea Property
Indicates if the area scheme is a Gross Building Area scheme.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsGrossBuildingArea { get; }
Public ReadOnly Property IsGrossBuildingArea As Boolean
	Get
public:
property bool IsGrossBuildingArea {
	bool get ();
}
member IsGrossBuildingArea : bool with get
Property Value
Boolean
See Also
Reference
AreaScheme Class
Autodesk.Revit.DB Namespace